const GUA = {
    "111111": {
        "ming": ["乾", "☰", "乾", "☰", "乾为天", "䷀"],
        "xiang": ["—", "—", "—", "—", "—", "—"],
        "guaci": ["乾为天", "元亨利贞"],
        "yao": ["初九", "九二", "九三", "九四", "九五", "上九"],
        "yaoci": ["潜龙勿用", "见龙在田,利见大人", "君子终日乾乾,夕惕若厉,无咎", "或跃在渊,无咎", "飞龙在天,利见大人", "亢龙,有悔"],
        "gong": ["乾宫", "金", "六冲"],
        "shiying": ["", "", "应", "", "", "世"],
        "ganzhi": ["甲子", "甲寅", "甲辰", "壬午", "壬申", "壬戌"],
        "wuxing": ["水", "木", "土", "火", "金", "土"],
        "liuqin": ["子孙", "妻财", "父母", "官鬼", "兄弟", "父母"],
        "fushen": ["", "", "", "", "", ""],
        "hucuozong": ["111111", "000000", "111111"],
    },
    "000000": {
        "ming": ["坤", "☷", "坤", "☷", "坤为地", "䷁"],
        "xiang": ["--", "--", "--", "--", "--", "--"],
        "guaci": ["坤为地", "元亨利牝马之贞 君子有攸往 先迷后得 主利 西南得朋 东北丧朋 安贞吉"],
        "yao": ["初六", "六二", "六三", "六四", "六五", "上六"],
        "yaoci": ["履霜坚冰至", "直方大,不习无不利", "含章可贞 或从王事 无成有终", "括囊 无咎无誉", "黄裳 元吉", "龙战于野 其血玄黄"],
        "gong": ["坤宫", "土", "六冲"],
        "shiying": ["", "", "应", "", "", "世"],
        "ganzhi": ["乙未", "乙巳", "乙卯", "癸丑", "癸亥", "癸酉"],
        "wuxing": ["土", "火", "木", "土", "水", "金"],
        "liuqin": ["兄弟", "父母", "官鬼", "兄弟", "妻财", "子孙"],
        "fushen": ["", "", "", "", "", ""],
        "hucuozong": ["000000", "111111", "000000"],
    },
    "100010": {
        "ming": ["坎", "☵", "震", "☳", "水雷屯", "䷂"],
        "xiang": ["—", "--", "--", "--", "—", "--"],
        "guaci": ["水雷屯", "元亨利贞 勿用有攸往利建侯"],
        "yao": ["初九", "六二", "六三", "六四", "九五", "上六"],
        "yaoci": ["磐桓 利居贞 利建侯", "屯如邅如 乘马班如 匪寇婚媾 女子贞不字 十年乃字", "即鹿无虞 惟入于林中 君子几不如舍 往吝", "乘马班如 求婚媾 往吉 无不利", "屯其膏 小贞吉 大贞凶", "乘马班如 泣血涟如"],
        "gong": ["坎宫", "水"],
        "shiying": ["", "世", "", "", "应", ""],
        "ganzhi": ["庚子", "庚寅", "庚辰", "戊申", "戊戌", "戊子"],
        "wuxing": ["水", "木", "土", "金", "土", "水"],
        "liuqin": ["兄弟", "子孙", "官鬼", "父母", "官鬼", "兄弟"],
        "fushen": ["", "", "妻财戊午火", "", "", ""],
        "hucuozong": ["000001", "011101", "010001"],
    },
    "010001": {
        "ming": ["艮", "☶", "坎", "☵", "山水蒙", "䷃"],
        "xiang": ["--", "—", "--", "--", "--", "—"],
        "guaci": ["山水蒙", "亨 匪我求童蒙 童蒙求我 初筮告 再三渎 渎则不告 利贞"],
        "yao": ["初六", "九二", "六三", "六四", "六五", "上九"],
        "yaoci": ["发蒙 利用刑人 用说桎梏 以往吝", "包蒙吉 纳妇吉 子克家", "勿用取女 见金夫 不有躬 无攸利", "困蒙 吝", "童蒙 吉", "击蒙 不利为寇 利御寇"],
        "gong": ["离宫", "火"],
        "shiying": ["应", "", "", "世", "", ""],
        "ganzhi": ["戊寅", "戊辰", "戊午", "丙戌", "丙子", "丙寅"],
        "wuxing": ["木", "土", "火", "土", "水", "木"],
        "liuqin": ["父母", "子孙", "兄弟", "子孙", "官鬼", "父母"],
        "fushen": ["", "", "", "妻财己酉金", "", ""],
        "hucuozong": ["100000", "101110", "100010"],
    },
    "111010": {
        "ming": ["坎", "☵", "乾", "☰", "水天需", "䷄"],
        "xiang": ["—", "—", "—", "--", "—", "--"],
        "guaci": ["水天需", "有孚 光亨贞吉 利涉大川"],
        "yao": ["初九", "九二", "九三", "六四", "九五", "上六"],
        "yaoci": ["需于郊 利用恒 无咎。", "需于沙 小有言 终吉", "需于泥 致寇至", "需于血 出自穴", "需于酒食 贞吉", "入于穴 有不速之客三人来 敬之终吉"],
        "gong": ["坤宫", "土"],
        "shiying": ["应", "", "", "世", "", ""],
        "ganzhi": ["甲子", "甲寅", "甲辰", "戊申", "戊戌", "戊子"],
        "wuxing": ["水", "木", "土", "金", "土", "水"],
        "liuqin": ["妻财", "官鬼", "兄弟", "子孙", "兄弟", "妻财"],
        "fushen": ["", "父母乙巳火", "", "", "", ""],
        "hucuozong": ["110101", "000101", "010111"],
    },
    "010111": {
        "ming": ["乾", "☰", "坎", "☵", "天水讼", "䷅"],
        "xiang": ["--", "—", "--", "—", "—", "—"],
        "guaci": ["天水讼", "有孚 窒惕 中吉 终凶 利见大人 不利涉大川"],
        "yao": ["初六", "九二", "六三", "九四", "九五", "上九"],
        "yaoci": ["不永所事 小有言 终吉", "不克讼 归而逋其邑 人三百户 无眚", "食旧德 贞厉 终吉 或从王事 无成", "不克讼 复既命 渝,安贞 吉", "讼元 吉", "或锡之鞶带 终朝三褫之"],
        "gong": ["离宫", "火"],
        "shiying": ["应", "", "", "世", "", ""],
        "ganzhi": ["戊寅", "戊辰", "戊午", "壬午", "壬申", "壬戌"],
        "wuxing": ["木", "土", "火", "火", "金", "土"],
        "liuqin": ["父母", "子孙", "兄弟", "兄弟", "妻财", "子孙"],
        "fushen": ["", "", "官鬼己亥水", "", "", ""],
        "hucuozong": ["101011", "101000", "111010"],
    },
    "010000": {
        "ming": ["坤", "☷", "坎", "☵", "地水师", "䷆"],
        "xiang": ["--", "—", "--", "--", "--", "--"],
        "guaci": ["地水师", "贞 丈人吉 无咎"],
        "yao": ["初六", "九二", "六三", "六四", "六五", "上六"],
        "yaoci": ["师出以律 否臧凶", "在师中吉,无咎 王三锡命", "师或舆尸 凶", "师左次 无咎", "田有禽 利执言 无咎 长子帅师 弟子舆尸 贞凶", "大君有命 开国承家 小人勿用"],
        "gong": ["坎宫", "水"],
        "shiying": ["", "", "世", "", "", "应"],
        "ganzhi": ["戊寅", "戊辰", "戊午", "癸丑", "癸亥", "癸酉"],
        "wuxing": ["木", "土", "火", "土", "水", "金"],
        "liuqin": ["子孙", "官鬼", "妻财", "官鬼", "兄弟", "父母"],
        "fushen": ["", "", "", "", "", ""],
        "hucuozong": ["100000", "101111", "000010"],
    },
    "000010": {
        "ming": ["坎", "☵", "坤", "☷", "水地比", "䷇"],
        "xiang": ["--", "--", "--", "--", "—", "--"],
        "guaci": ["水地比", "吉 原筮,元永贞,无咎 不宁方来,后夫凶"],
        "yao": ["初六", "六二", "六三", "六四", "九五", "上六"],
        "yaoci": ["有孚比之 无咎 有孚盈缶 终来有它吉", "比之自内 贞吉", "比之匪人", "外比之 贞吉", "显比 王用三驱 失前禽 邑人不诫 吉", "比之无首 凶"],
        "gong": ["坤宫", "土"],
        "shiying": ["", "", "世", "", "", "应"],
        "ganzhi": ["乙未", "乙巳", "乙卯", "戊申", "戊戌", "戊子"],
        "wuxing": ["土", "火", "木", "金", "土", "水"],
        "liuqin": ["兄弟", "父母", "官鬼", "子孙", "兄弟", "妻财"],
        "fushen": ["", "", "", "", "", ""],
        "hucuozong": ["000001", "111101", "010000"],
    },
    "111011": {
        "ming": ["巽", "☴", "乾", "☰", "风天小畜", "䷈"],
        "xiang": ["—", "—", "—", "--", "—", "—"],
        "guaci": ["风天小畜", "亨 密云不雨,自我西郊"],
        "yao": ["初九", "九二", "九三", "六四", "九五", "上九"],
        "yaoci": ["复自道 何其咎 吉", "牵复 吉", "舆说辐 夫妻反目", "有孚 血去惕出 无咎", "有孚挛如 富以其邻", "既雨既处 尚德载 妇贞厉 月几望 君子征凶"],
        "gong": ["巽宫", "木"],
        "shiying": ["世", "", "", "应", "", ""],
        "ganzhi": ["甲子", "甲寅", "甲辰", "辛未", "辛巳", "辛卯"],
        "wuxing": ["水", "木", "土", "土", "火", "木"],
        "liuqin": ["父母", "兄弟", "妻财", "妻财", "子孙", "兄弟"],
        "fushen": ["", "", "官鬼辛酉金", "", "", ""],
        "hucuozong": ["110101", "000100", "110111"],
    },
    "110111": {
        "ming": ["乾", "☰", "兑", "☱", "天泽履", "䷉"],
        "xiang": ["—", "—", "--", "—", "—", "—"],
        "guaci": ["天泽履", "履虎尾 不咥人 亨"],
        "yao": ["初九", "九二", "六三", "九四", "九五", "上九"],
        "yaoci": ["素履往 无咎", "履道坦坦 幽人贞吉", "眇能视 跛能履 履虎尾 咥人凶 武人为于大君", "履虎尾 愬愬,终吉", "夬履 贞厉", "视履考祥 其旋元吉"],
        "gong": ["艮宫", "土"],
        "shiying": ["", "应", "", "", "世", ""],
        "ganzhi": ["丁巳", "丁卯", "丁丑", "壬午", "壬申", "壬戌"],
        "wuxing": ["火", "木", "土", "火", "金", "土"],
        "liuqin": ["父母", "官鬼", "兄弟", "父母", "子孙", "兄弟"],
        "fushen": ["", "", "", "", "妻财丙子水", ""],
        "hucuozong": ["101011", "001000", "111011"],
    },
    "111000": {
        "ming": ["坤", "☷", "乾", "☰", "地天泰", "䷊"],
        "xiang": ["—", "—", "—", "--", "--", "--"],
        "guaci": ["地天泰", "小往大来 吉亨"],
        "yao": ["初九", "九二", "九三", "六四", "六五", "上六"],
        "yaoci": ["拔茅茹 以其汇 征吉", "包荒 用冯河 不遐遗 朋亡 得,尚于中行", "无平不陂 无往不复 艰贞无咎 勿恤其孚 于食有福", "翩翩 不富以其邻 不戒以孚", "帝乙归妹 以祉元吉", "城复于隍,勿用师,自邑告命 贞吝"],
        "gong": ["坤宫", "土", "六合"],
        "shiying": ["", "", "世", "", "", "应"],
        "ganzhi": ["甲子", "甲寅", "甲辰", "癸丑", "癸亥", "癸酉"],
        "wuxing": ["水", "木", "土", "土", "水", "金"],
        "liuqin": ["妻财", "官鬼", "兄弟", "兄弟", "妻财", "子孙"],
        "fushen": ["", "父母乙巳火", "", "", "", ""],
        "hucuozong": ["110100", "000111", "000111"],
    },
    "000111": {
        "ming": ["乾", "☰", "坤", "☷", "天地否", "䷋"],
        "xiang": ["--", "--", "--", "—", "—", "—"],
        "guaci": ["天地否", "否之匪人 不利君子贞 大往小来 "],
        "yao": ["初六", "六二", "六三", "九四", "九五", "上九"],
        "yaoci": ["拔茅茹 以其汇 贞吉 亨", "包承 小人吉 大人否 亨", "包羞", "有命无咎 畴离祉", "休否 大人吉 其亡其亡 系于苞桑", "倾否 先否后喜"],
        "gong": ["乾宫", "金", "六合"],
        "shiying": ["", "", "世", "", "", "应"],
        "ganzhi": ["乙未", "乙巳", "乙卯", "壬午", "壬申", "壬戌"],
        "wuxing": ["土", "火", "木", "火", "金", "土"],
        "liuqin": ["父母", "官鬼", "妻财", "官鬼", "兄弟", "父母"],
        "fushen": ["子孙甲子水", "", "", "", "", ""],
        "hucuozong": ["001011", "111000", "111000"],
    },
    "101111": {
        "ming": ["乾", "☰", "离", "☲", "天火同人", "䷌"],
        "xiang": ["—", "--", "—", "—", "—", "—"],
        "guaci": ["天火同人", "同人于野,亨 利涉大川 利君子贞"],
        "yao": ["初九", "六二", "九三", "九四", "九五", "上九"],
        "yaoci": ["同人于门 无咎", "同人于宗 吝", "伏戎于莽 升其高陵 三岁不兴", "乘其墉 弗克攻 吉", "同人先号咷而后笑 大师克相遇", "同人于郊 无悔"],
        "gong": ["离宫", "火"],
        "shiying": ["", "", "世", "", "", "应"],
        "ganzhi": ["己卯", "己丑", "己亥", "壬午", "壬申", "壬戌"],
        "wuxing": ["木", "土", "水", "火", "金", "土"],
        "liuqin": ["父母", "子孙", "官鬼", "兄弟", "妻财", "子孙"],
        "fushen": ["", "", "", "", "", ""],
        "hucuozong": ["011111", "010000", "111101"],
    },
    "111101": {
        "ming": ["离", "☲", "乾", "☰", "火天大有", "䷍"],
        "xiang": ["—", "—", "—", "—", "--", "—"],
        "guaci": ["火天大有", "元亨"],
        "yao": ["初九", "九二", "九三", "九四", "六五", "上九"],
        "yaoci": ["无交害 匪咎 艰则无咎", "大车以载 有攸往 无咎", "公用亨于天子 小人弗克", "匪其彭 无咎", "厥孚交加 威如 吉", "自天佑之吉无不利"],
        "gong": ["乾宫", "金"],
        "shiying": ["", "", "世", "", "", "应"],
        "ganzhi": ["甲子", "甲寅", "甲辰", "己酉", "己未", "己巳"],
        "wuxing": ["水", "木", "土", "金", "土", "火"],
        "liuqin": ["子孙", "妻财", "父母", "兄弟", "父母", "官鬼"],
        "fushen": ["", "", "", "", "", ""],
        "hucuozong": ["111110", "000010", "101111"],
    },
    "001000": {
        "ming": ["坤", "☷", "艮", "☶", "地山谦", "䷎"],
        "xiang": ["--", "--", "—", "--", "--", "--"],
        "guaci": ["地山谦", "亨 君子有终"],
        "yao": ["初六", "六二", "九三", "六四", "六五", "上六"],
        "yaoci": ["谦谦君子 用涉大川 吉", "鸣谦 贞吉", "劳谦君子 有终吉", "无不利㧑谦", "不富以其邻 利用侵伐 无不利", "鸣谦 利用行师 征邑国"],
        "gong": ["兑宫", "金"],
        "shiying": ["", "应", "", "", "世", ""],
        "ganzhi": ["丙辰", "丙午", "丙申", "癸丑", "癸亥", "癸酉"],
        "wuxing": ["土", "火", "金", "土", "水", "金"],
        "liuqin": ["父母", "官鬼", "兄弟", "父母", "子孙", "兄弟"],
        "fushen": ["", "妻财丁卯木", "", "", "", ""],
        "hucuozong": ["010100", "110111", "000100"],
    },
    "000100": {
        "ming": ["震", "☳", "坤", "☷", "雷地豫", "䷏"],
        "xiang": ["--", "--", "--", "—", "--", "--"],
        "guaci": ["雷地豫", "利建侯行师"],
        "yao": ["初六", "六二", "六三", "九四", "六五", "上六"],
        "yaoci": ["鸣豫 凶", "介于石 不终日 贞吉", "盱豫悔 迟有悔", "由豫 大有得 勿疑 朋盍簪", "贞疾 恒不死", "冥豫 成有渝 无咎"],
        "gong": ["震宫", "木", "六合"],
        "shiying": ["世", "", "", "应", "", ""],
        "ganzhi": ["乙未", "乙巳", "乙卯", "庚午", "庚申", "庚戌"],
        "wuxing": ["土", "火", "木", "火", "金", "土"],
        "liuqin": ["妻财", "子孙", "兄弟", "子孙", "官鬼", "妻财"],
        "fushen": ["父母庚子水", "", "", "", "", ""],
        "hucuozong": ["001010", "111011", "001000"],
    },
    "100110": {
        "ming": ["兑", "☱", "震", "☳", "泽雷随", "䷐"],
        "xiang": ["—", "--", "--", "—", "—", "--"],
        "guaci": ["泽雷随", "元亨利贞 无咎"],
        "yao": ["初九", "六二", "六三", "九四", "九五", "上六"],
        "yaoci": ["官有渝 贞吉 出门交有功", "系小子 失丈夫", "系丈夫 失小子,随有求得 利居贞", "随有获 贞凶 有孚在道以明何咎", "孚于嘉 吉", "拘系之 乃从维之 王用亨于西山"],
        "gong": ["震宫", "木"],
        "shiying": ["", "", "世", "", "", "应"],
        "ganzhi": ["庚子", "庚寅", "庚辰", "丁亥", "丁酉", "丁未"],
        "wuxing": ["水", "木", "土", "水", "金", "土"],
        "liuqin": ["父母", "兄弟", "妻财", "父母", "官鬼", "妻财"],
        "fushen": ["", "", "", "子孙庚午火", "", ""],
        "hucuozong": ["001011", "011001", "011001"],
    },
    "011001": {
        "ming": ["艮", "☶", "巽", "☴", "山风蛊", "䷑"],
        "xiang": ["--", "—", "—", "--", "--", "—"],
        "guaci": ["山风蛊", "元亨 利涉大川 先甲三日 后甲三日"],
        "yao": ["初六", "九二", "九三", "六四", "六五", "上九"],
        "yaoci": ["干父之蛊 有子 考无咎 厉 终吉", "干母之蛊 不可贞", "干父之蛊 小有晦 无大咎", "裕父之蛊 往见吝", "干父之蛊 用誉", "不事王侯 高尚其事"],
        "gong": ["巽宫", "木"],
        "shiying": ["", "", "世", "", "", "应"],
        "ganzhi": ["辛丑", "辛亥", "辛酉", "丙戌", "丙子", "丙寅"],
        "wuxing": ["土", "水", "金", "土", "水", "木"],
        "liuqin": ["妻财", "父母", "官鬼", "妻财", "父母", "兄弟"],
        "fushen": ["", "", "", "", "子孙辛巳火", ""],
        "hucuozong": ["110100", "100110", "100110"],
    },
    "110000": {
        "ming": ["坤", "☷", "兑", "☱", "地泽临", "䷒"],
        "xiang": ["—", "—", "--", "--", "--", "--"],
        "guaci": ["地泽临", "元亨利贞 至于八月有凶"],
        "yao": ["初九", "九二", "六三", "六四", "六五", "上六"],
        "yaoci": ["咸临,贞吉", "咸临吉 无不利", "甘临 无攸利 既忧之 无咎", "至临 无咎", "知临 大君之宜 吉", "敦临 吉 无咎"],
        "gong": ["坤宫", "土"],
        "shiying": ["", "世", "", "", "应", ""],
        "ganzhi": ["丁巳", "丁卯", "丁丑", "癸丑", "癸亥", "癸酉"],
        "wuxing": ["火", "木", "土", "土", "水", "金"],
        "liuqin": ["父母", "官鬼", "兄弟", "兄弟", "妻财", "子孙"],
        "fushen": ["", "", "", "", "", ""],
        "hucuozong": ["100000", "001111", "000011"],
    },
    "000011": {
        "ming": ["巽", "☴", "坤", "☷", "风地观", "䷓"],
        "xiang": ["--", "--", "--", "--", "—", "—"],
        "guaci": ["风地观", "盥而不荐 有孚颙若"],
        "yao": ["初六", "六二", "六三", "六四", "九五", "上九"],
        "yaoci": ["童观 小人无咎 君子吝", "窥观 利女贞", "观我生进退", "观国之光 利用宾于王", "观我生 君子无咎", "观其生 君子无咎"],
        "gong": ["乾宫", "金"],
        "shiying": ["应", "", "", "世", "", ""],
        "ganzhi": ["乙未", "乙巳", "乙卯", "辛未", "辛巳", "辛卯"],
        "wuxing": ["土", "火", "木", "土", "火", "木"],
        "liuqin": ["父母", "官鬼", "妻财", "父母", "官鬼", "妻财"],
        "fushen": ["子孙甲子水", "", "", "", "兄弟壬申金", ""],
        "hucuozong": ["000001", "111100", "110000"],
    },
    "100101": {
        "ming": ["离", "☲", "震", "☳", "火雷噬嗑", "䷔"],
        "xiang": ["—", "--", "--", "—", "--", "—"],
        "guaci": ["火雷噬嗑", "亨 利用狱"],
        "yao": ["初九", "六二", "六三", "九四", "六五", "上九"],
        "yaoci": ["屦校灭趾 无咎", "噬肤灭鼻 无咎", "噬腊肉遇毒 小吝 无咎", "噬干胏 得金矢,利艰贞 吉", "噬干肉 得黄金 贞厉 无咎", "何校灭耳 凶"],
        "gong": ["巽宫", "木"],
        "shiying": ["", "应", "", "", "世", ""],
        "ganzhi": ["庚子", "庚寅", "庚辰", "己酉", "己未", "己巳"],
        "wuxing": ["水", "木", "土", "金", "土", "火"],
        "liuqin": ["父母", "兄弟", "妻财", "官鬼", "妻财", "子孙"],
        "fushen": ["", "", "", "", "", ""],
        "hucuozong": ["001010", "011010", "101001"],
    },
    "101001": {
        "ming": ["艮", "☶", "离", "☲", "山火贲", "䷕"],
        "xiang": ["—", "--", "—", "--", "--", "—"],
        "guaci": ["山火贲", "亨 小利有攸往"],
        "yao": ["初九", "六二", "九三", "六四", "六五", "上九"],
        "yaoci": ["贲其趾 舍车而徒", "贲其须", "贲如濡如 永贞吉", "贲如皤如 白马翰如 匪寇婚媾", "贲于丘园 束帛戋戋 吝 终吉", "白贲 无咎"],
        "gong": ["艮宫", "土", "六合"],
        "shiying": ["世", "", "", "应", "", ""],
        "ganzhi": ["己卯", "己丑", "己亥", "丙戌", "丙子", "丙寅"],
        "wuxing": ["木", "土", "水", "土", "水", "木"],
        "liuqin": ["官鬼", "兄弟", "妻财", "兄弟", "妻财", "官鬼"],
        "fushen": ["", "父母丙午火", "子孙丙申金", "", "", ""],
        "hucuozong": ["010100", "010110", "100101"],
    },
    "000001": {
        "ming": ["艮", "☶", "坤", "☷", "山地剥", "䷖"],
        "xiang": ["--", "--", "--", "--", "--", "—"],
        "guaci": ["山地剥", "不利有攸往"],
        "yao": ["初六", "六二", "六三", "六四", "六五", "上九"],
        "yaoci": ["剥床以足 蔑贞凶", "剥床以辨 蔑贞凶", "剥之无咎", "剥床以肤 凶", "贯鱼 以宫人宠 无不利", "硕果不食 君子得舆 小人剥庐"],
        "gong": ["乾宫", "金"],
        "shiying": ["", "应", "", "", "世", ""],
        "ganzhi": ["乙未", "乙巳", "乙卯", "丙戌", "丙子", "丙寅"],
        "wuxing": ["土", "火", "木", "土", "水", "木"],
        "liuqin": ["父母", "官鬼", "妻财", "父母", "子孙", "妻财"],
        "fushen": ["", "", "", "", "兄弟壬申金", ""],
        "hucuozong": ["000000", "111110", "100000"],
    },
    "100000": {
        "ming": ["坤", "☷", "震", "☳", "地雷复", "䷗"],
        "xiang": ["—", "--", "--", "--", "--", "--"],
        "guaci": ["地雷复", "亨 出入无疾 朋来无咎 反复其道 七日来复 利有攸往"],
        "yao": ["初九", "六二", "六三", "六四", "六五", "上六"],
        "yaoci": ["不远复 无祗悔 元吉", "休复 吉", "频复 厉 无咎", "中行独复", "敦复 无悔", "迷复 凶 有灾眚 用行师 终有大败 以其国 君凶,至于十年不克征"],
        "gong": ["坤宫", "土", "六合"],
        "shiying": ["世", "", "", "应", "", ""],
        "ganzhi": ["庚子", "庚寅", "庚辰", "癸丑", "癸亥", "癸酉"],
        "wuxing": ["水", "木", "土", "土", "水", "金"],
        "liuqin": ["妻财", "官鬼", "兄弟", "兄弟", "妻财", "子孙"],
        "fushen": ["", "父母乙巳火", "", "", "", ""],
        "hucuozong": ["000000", "011111", "000001"],
    },
    "100111": {
        "ming": ["乾", "☰", "震", "☳", "天雷无妄", "䷘"],
        "xiang": ["—", "--", "--", "—", "—", "—"],
        "guaci": ["天雷无妄", "元亨利贞 其匪正有眚 不利有攸往"],
        "yao": ["初九", "六二", "六三", "九四", "九五", "上九"],
        "yaoci": ["无妄 往吉", "不耕获 不菑畲 则利有攸往", "无妄之灾 或系之牛 行人之得 邑人之灾", "可贞 无咎", "无妄之疾 勿药有喜", "无妄 行有眚 无攸利"],
        "gong": ["巽宫", "木", "六冲"],
        "shiying": ["应", "", "", "世", "", ""],
        "ganzhi": ["庚子", "庚寅", "庚辰", "壬午", "壬申", "壬戌"],
        "wuxing": ["水", "木", "土", "火", "金", "土"],
        "liuqin": ["父母", "兄弟", "妻财", "子孙", "官鬼", "妻财"],
        "fushen": ["", "", "", "", "", ""],
        "hucuozong": ["001011", "011000", "111001"],
    },
    "111001": {
        "ming": ["艮", "☶", "乾", "☰", "山天大畜", "䷙"],
        "xiang": ["—", "—", "—", "--", "--", "—"],
        "guaci": ["山天大畜", "利贞 不家食 吉 利涉大川"],
        "yao": ["初九", "九二", "九三", "六四", "六五", "上九"],
        "yaoci": ["有厉 利已", "舆说輹", "良马逐 利艰贞 日闲舆卫 利有攸往", "童牛之牿 元吉", "豶豕之牙 吉", "何天之衢 亨"],
        "gong": ["艮宫", "土"],
        "shiying": ["", "世", "", "", "应", ""],
        "ganzhi": ["甲子", "甲寅", "甲辰", "丙戌", "丙子", "丙寅"],
        "wuxing": ["水", "木", "土", "土", "水", "木"],
        "liuqin": ["妻财", "官鬼", "兄弟", "兄弟", "妻财", "官鬼"],
        "fushen": ["", "父母丙午火", "子孙丙申金", "", "", ""],
        "hucuozong": ["110100", "000110", "100111"],
    },
    "100001": {
        "ming": ["艮", "☶", "震", "☳", "山雷颐", "䷚"],
        "xiang": ["—", "--", "--", "--", "--", "—"],
        "guaci": ["山雷颐", "贞吉 观颐 自求口实"],
        "yao": ["初九", "六二", "六三", "六四", "六五", "上九"],
        "yaoci": ["舍尔灵龟 观我朵颐 凶", "颠颐 拂经于丘 颐征凶", "拂颐 贞凶 十年勿用 无攸利", "颠颐 吉 虎视眈眈 其欲逐逐 无咎", "拂经 居贞吉 不可涉大川", "由颐 厉吉 利涉大川"],
        "gong": ["巽宫", "木"],
        "shiying": ["应", "", "", "世", "", ""],
        "ganzhi": ["庚子", "庚寅", "庚辰", "丙戌", "丙子", "丙寅"],
        "wuxing": ["水", "木", "土", "土", "水", "木"],
        "liuqin": ["父母", "兄弟", "妻财", "妻财", "父母", "兄弟"],
        "fushen": ["", "", "官鬼辛酉金", "", "子孙辛巳火", ""],
        "hucuozong": ["000000", "011110", "100001"],
    },
    "011110": {
        "ming": ["兑", "☱", "巽", "☴", "泽风大过", "䷛"],
        "xiang": ["--", "—", "—", "—", "—", "--"],
        "guaci": ["泽风大过", "栋桡 利于攸往 亨"],
        "yao": ["初六", "九二", "九三", "九四", "九五", "上六"],
        "yaoci": ["藉用白茅 无咎", "枯杨生稊 老夫得其女妻 无不利", "栋桡 凶", "栋隆 吉 有它吝", "枯杨生华 老妇得其士夫 无咎无誉", "过涉灭顶 凶 无咎"],
        "gong": ["震宫", "木"],
        "shiying": ["应", "", "", "世", "", ""],
        "ganzhi": ["辛丑", "辛亥", "辛酉", "丁亥", "丁酉", "丁未"],
        "wuxing": ["土", "水", "金", "水", "金", "土"],
        "liuqin": ["妻财", "父母", "官鬼", "父母", "官鬼", "妻财"],
        "fushen": ["", "兄弟庚寅木", "", "子孙庚午火", "", ""],
        "hucuozong": ["111111", "100001", "011110"],
    },
    "010010": {
        "ming": ["坎", "☵", "坎", "☵", "坎为水", "䷜"],
        "xiang": ["--", "—", "--", "--", "—", "--"],
        "guaci": ["坎为水", "习坎 有孚 维心亨 行有尚"],
        "yao": ["初六", "九二", "六三", "六四", "九五", "上六"],
        "yaoci": ["习坎 入于坎窞 凶", "坎有险 求小得", "来之坎坎 险且枕 入于坎窞 勿用", "樽酒簋贰 用缶 纳约自牖 终无咎", "坎不盈 祗既平 无咎", "系用徽纆 寘于丛棘 三岁不得 凶"],
        "gong": ["坎宫", "水", "六冲"],
        "shiying": ["", "", "应", "", "", "世"],
        "ganzhi": ["戊寅", "戊辰", "戊午", "戊申", "戊戌", "戊子"],
        "wuxing": ["木", "土", "火", "金", "土", "水"],
        "liuqin": ["子孙", "官鬼", "妻财", "父母", "官鬼", "兄弟"],
        "fushen": ["", "", "", "", "", ""],
        "hucuozong": ["100001", "101101", "010010"],
    },
    "101101": {
        "ming": ["离", "☲", "离", "☲", "离为火", "䷝"],
        "xiang": ["—", "--", "—", "—", "--", "—"],
        "guaci": ["离为火", "利贞 亨 畜牝牛 吉"],
        "yao": ["初九", "六二", "九三", "九四", "六五", "上九"],
        "yaoci": ["履错然 敬之 无咎", "黄离 元吉", "日昃之离 不鼓缶而歌 则大耋之嗟 凶", "突如其来如 焚如 死如 弃如", "出涕沱若 戚嗟若 吉", "王用出征 有嘉 折首 获匪其丑 无咎"],
        "gong": ["离宫", "火", "六冲"],
        "shiying": ["", "", "应", "", "", "世"],
        "ganzhi": ["己卯", "己丑", "己亥", "己酉", "己未", "己巳"],
        "wuxing": ["木", "土", "水", "金", "土", "火"],
        "liuqin": ["父母", "子孙", "官鬼", "妻财", "子孙", "兄弟"],
        "fushen": ["", "", "", "", "", ""],
        "hucuozong": ["011110", "010010", "101101"],
    },
    "001110": {
        "ming": ["兑", "☱", "艮", "☶", "泽山咸", "䷞"],
        "xiang": ["--", "--", "—", "—", "—", "--"],
        "guaci": ["泽山咸", "亨 利贞 娶女吉"],
        "yao": ["初六", "六二", "九三", "九四", "九五", "上六"],
        "yaoci": ["咸其拇", "咸其腓 凶 居吉", "咸其股 执其随 往吝", "贞吉悔亡 憧憧往来 朋从尔思", "咸其脢,无悔", "咸其辅颊舌"],
        "gong": ["兑宫", "金"],
        "shiying": ["", "", "世", "", "", "应"],
        "ganzhi": ["丙辰", "丙午", "丙申", "丁亥", "丁酉", "丁未"],
        "wuxing": ["土", "火", "金", "水", "金", "土"],
        "liuqin": ["父母", "官鬼", "兄弟", "子孙", "兄弟", "父母"],
        "fushen": ["", "妻财丁卯木", "", "", "", ""],
        "hucuozong": ["011111", "110001", "011100"],
    },
    "011100": {
        "ming": ["震", "☳", "巽", "☴", "雷风恒", "䷟"],
        "xiang": ["--", "—", "—", "—", "--", "--"],
        "guaci": ["雷风恒", "亨 无吝 利贞 利有攸往"],
        "yao": ["初六", "九二", "九三", "九四", "六五", "上六"],
        "yaoci": ["浚恒贞凶 无攸利", "悔亡", "不恒其德 或承之羞 贞吝", "田无禽", "恒其德贞 妇人吉 夫子凶", "振恒,凶"],
        "gong": ["震宫", "木"],
        "shiying": ["", "", "世", "", "", "应"],
        "ganzhi": ["辛丑", "辛亥", "辛酉", "庚午", "庚申", "庚戌"],
        "wuxing": ["土", "水", "金", "火", "金", "土"],
        "liuqin": ["妻财", "父母", "官鬼", "子孙", "官鬼", "妻财"],
        "fushen": ["", "兄弟庚寅木", "", "", "", ""],
        "hucuozong": ["111110", "100011", "001110"],
    },
    "001111": {
        "ming": ["乾", "☰", "艮", "☶", "天山遯", "䷠"],
        "xiang": ["--", "--", "—", "—", "—", "—"],
        "guaci": ["天山遯", "亨 小利贞"],
        "yao": ["初六", "六二", "九三", "九四", "九五", "上九"],
        "yaoci": ["遯尾厉 勿用有攸往", "执之用黄牛之革,莫之胜说", "系遯 有疾厉 畜臣妾吉", "好遯 君子吉 小人否", "嘉遯贞吉。", "肥遯无不利"],
        "gong": ["乾宫", "金"],
        "shiying": ["", "世", "", "", "应", ""],
        "ganzhi": ["丙辰", "丙午", "丙申", "壬午", "壬申", "壬戌"],
        "wuxing": ["土", "火", "金", "火", "金", "土"],
        "liuqin": ["父母", "官鬼", "兄弟", "官鬼", "兄弟", "父母"],
        "fushen": ["子孙甲子水", "妻财甲寅木", "", "", "", ""],
        "hucuozong": ["011111", "110000", "111100"],
    },
    "111100": {
        "ming": ["震", "☳", "乾", "☰", "雷天大壮", "䷡"],
        "xiang": ["—", "—", "—", "—", "--", "--"],
        "guaci": ["雷天大壮", "利贞"],
        "yao": ["初九", "九二", "九三", "九四", "六五", "上六"],
        "yaoci": ["壮于趾 征凶有孚", "贞吉", "小人用壮 君子用罔 贞厉 羝羊触藩 羸其角", "贞吉 悔亡 藩决不羸 壮于大舆之輹", "丧羊于易 无悔", "羝羊触藩 不能退 不能遂 无攸利 艰则吉"],
        "gong": ["坤宫", "土", "六冲"],
        "shiying": ["应", "", "", "世", "", ""],
        "ganzhi": ["甲子", "甲寅", "甲辰", "庚午", "庚申", "庚戌"],
        "wuxing": ["水", "木", "土", "火", "金", "土"],
        "liuqin": ["妻财", "官鬼", "兄弟", "父母", "子孙", "兄弟"],
        "fushen": ["", "", "", "", "", ""],
        "hucuozong": ["111110", "000011", "001111"],
    },
    "000101": {
        "ming": ["离", "☲", "坤", "☷", "火地晋", "䷢"],
        "xiang": ["--", "--", "--", "—", "--", "—"],
        "guaci": ["火地晋", "康侯用锡马蕃蔗 昼日三接"],
        "yao": ["初六", "六二", "六三", "九四", "六五", "上九"],
        "yaoci": ["晋如摧如 贞吉 罔孚 裕无咎", "晋如愁如 贞吉 受兹介福,于其王母", "众允悔亡", "晋如鼫鼠 贞厉", "悔亡 失得勿恤 往吉无不利", "晋其角 维用伐邑 厉吉无咎 贞吝"],
        "gong": ["乾宫", "金"],
        "shiying": ["应", "", "", "世", "", ""],
        "ganzhi": ["乙未", "乙巳", "乙卯", "己酉", "己未", "己巳"],
        "wuxing": ["土", "火", "木", "金", "土", "火"],
        "liuqin": ["父母", "官鬼", "妻财", "兄弟", "父母", "官鬼"],
        "fushen": ["子孙甲子水", "", "", "", "", ""],
        "hucuozong": ["001010", "111010", "101000"],
    },
    "101000": {
        "ming": ["坤", "☷", "离", "☲", "地火明夷", "䷣"],
        "xiang": ["—", "--", "—", "--", "--", "--"],
        "guaci": ["地火明夷", "利艰贞"],
        "yao": ["初九", "六二", "九三", "六四", "六五", "上六"],
        "yaoci": ["明夷于飞 垂其翼 君子于行 三日不食 有攸往 主人有言", "明夷 夷于左股 用拯马壮吉", "明夷于南狩 得其大首 不可疾贞", "入于左腹 获明夷之心 出于门庭", "箕子之明夷 利贞", "不明晦 初登于天 后入于地"],
        "gong": ["坎宫", "水"],
        "shiying": ["应", "", "", "世", "", ""],
        "ganzhi": ["己卯", "己丑", "己亥", "癸丑", "癸亥", "癸酉"],
        "wuxing": ["木", "土", "水", "土", "水", "金"],
        "liuqin": ["子孙", "官鬼", "兄弟", "官鬼", "兄弟", "父母"],
        "fushen": ["", "", "妻财戊午火", "", "", ""],
        "hucuozong": ["010100", "010111", "000101"],
    },
    "101011": {
        "ming": ["巽", "☴", "离", "☲", "风火家人", "䷤"],
        "xiang": ["—", "--", "—", "--", "—", "—"],
        "guaci": ["风火家人", "利女贞"],
        "yao": ["初九", "六二", "九三", "六四", "九五", "上九"],
        "yaoci": ["闲有家 悔亡", "无攸遂 在中馈 贞吉", "家人嗃嗃 悔厉 吉 妇子嘻嘻 终吝", "富家大吉", "王假有家 勿恤吉", "有孚威如 终吉"],
        "gong": ["巽宫", "木"],
        "shiying": ["", "世", "", "", "应", ""],
        "ganzhi": ["己卯", "己丑", "己亥", "辛未", "辛巳", "辛卯"],
        "wuxing": ["木", "土", "水", "土", "火", "木"],
        "liuqin": ["兄弟", "妻财", "父母", "妻财", "子孙", "兄弟"],
        "fushen": ["", "", "官鬼辛酉金", "", "", ""],
        "hucuozong": ["010101", "010100", "110101"],
    },
    "110101": {
        "ming": ["离", "☲", "兑", "☱", "火泽睽", "䷥"],
        "xiang": ["—", "—", "--", "—", "--", "—"],
        "guaci": ["火泽睽", "小事吉"],
        "yao": ["初九", "九二", "六三", "九四", "六五", "上九"],
        "yaoci": ["悔亡 丧马勿逐,自复 见恶人 无咎", "遇主于巷 无咎", "见舆曳 其牛掣 其人天且劓 无初有终", "睽孤 遇元夫 交孚 厉无咎", "悔亡 厥宗噬肤 往何咎", "睽孤 见豕负涂 载鬼一车 先张之弧 后说之弧 匪寇婚媾 往遇雨则吉"],
        "gong": ["艮宫", "土"],
        "shiying": ["应", "", "", "世", "", ""],
        "ganzhi": ["丁巳", "丁卯", "丁丑", "己酉", "己未", "己巳"],
        "wuxing": ["火", "木", "土", "金", "土", "火"],
        "liuqin": ["父母", "官鬼", "兄弟", "子孙", "兄弟", "父母"],
        "fushen": ["", "", "", "", "妻财丙子水", ""],
        "hucuozong": ["101010", "001010", "101011"],
    },
    "001010": {
        "ming": ["坎", "☵", "艮", "☶", "水山蹇", "䷦"],
        "xiang": ["--", "--", "—", "--", "—", "--"],
        "guaci": ["水山蹇", "利西南 不利东北 利见大人 贞吉"],
        "yao": ["初六", "六二", "九三", "六四", "九五", "上六"],
        "yaoci": ["往蹇来誉", "王臣蹇蹇 匪躬之故", "往蹇来反", "往蹇来连", "大蹇朋来", "往蹇来硕 吉 利见大人"],
        "gong": ["兑宫", "金"],
        "shiying": ["", "应", "", "", "世", ""],
        "ganzhi": ["丙辰", "丙午", "丙申", "戊申", "戊戌", "戊子"],
        "wuxing": ["土", "火", "金", "金", "土", "水"],
        "liuqin": ["父母", "官鬼", "兄弟", "兄弟", "父母", "子孙"],
        "fushen": ["", "妻财丁卯木", "", "", "", ""],
        "hucuozong": ["010101", "110101", "010100"],
    },
    "010100": {
        "ming": ["震", "☳", "坎", "☵", "雷水解", "䷧"],
        "xiang": ["--", "—", "--", "—", "--", "--"],
        "guaci": ["雷水解", "利西南 无所往 其来复吉 有攸往 夙吉"],
        "yao": ["初六", "九二", "六三", "九四", "六五", "上六"],
        "yaoci": ["无咎", "田获三狐 得黄矢 贞吉", "负且乘 致寇至 贞吝", "解而拇 朋至斯孚", "君子维有解 吉 有孚于小人", "公用射隼于高墉之上 获之无不利"],
        "gong": ["震宫", "木"],
        "shiying": ["", "世", "", "", "应", ""],
        "ganzhi": ["戊寅", "戊辰", "戊午", "庚午", "庚申", "庚戌"],
        "wuxing": ["木", "土", "火", "火", "金", "土"],
        "liuqin": ["兄弟", "妻财", "子孙", "子孙", "官鬼", "妻财"],
        "fushen": ["父母庚子水", "", "", "", "", ""],
        "hucuozong": ["101010", "101011", "001010"],
    },
    "110001": {
        "ming": ["艮", "☶", "兑", "☱", "山泽损", "䷨"],
        "xiang": ["—", "—", "--", "--", "--", "—"],
        "guaci": ["山泽损", "有孚 元吉 无咎可贞 利有攸往 曷之用 二簋可用享"],
        "yao": ["初九", "九二", "六三", "六四", "六五", "上九"],
        "yaoci": ["已事遄往 无咎 酌损之", "利贞 征凶 弗损益之", "三人行 则损一人 一人行 则得其友", "损其疾 使遄有喜 无咎", "或益之十朋之龟 弗克违 元吉", "弗损益之 无咎 贞吉 利有攸往 得臣无家"],
        "gong": ["艮宫", "土"],
        "shiying": ["", "", "世", "", "", "应"],
        "ganzhi": ["丁巳", "丁卯", "丁丑", "丙戌", "丙子", "丙寅"],
        "wuxing": ["火", "木", "土", "土", "水", "木"],
        "liuqin": ["父母", "官鬼", "兄弟", "兄弟", "妻财", "官鬼"],
        "fushen": ["", "", "子孙丙申金", "", "", ""],
        "hucuozong": ["100000", "001110", "100011"],
    },
    "100011": {
        "ming": ["巽", "☴", "震", "☳", "风雷益", "䷩"],
        "xiang": ["—", "--", "--", "--", "—", "—"],
        "guaci": ["风雷益", "利有攸往 利涉大川"],
        "yao": ["初九", "六二", "六三", "六四", "九五", "上九"],
        "yaoci": ["利用为大作 元吉无咎", "或益之十朋之龟,弗克违 永贞吉 王用享于帝 吉", "益之 用凶事 无咎 有孚中行 告公用圭", "中行 告公从 利用为依迁国", "有孚惠心 勿问元吉 有孚惠我德", "莫益之 或击之 立心勿恒 凶"],
        "gong": ["巽宫", "木"],
        "shiying": ["", "", "世", "", "", "应"],
        "ganzhi": ["庚子", "庚寅", "庚辰", "辛未", "辛巳", "辛卯"],
        "wuxing": ["水", "木", "土", "土", "火", "木"],
        "liuqin": ["父母", "兄弟", "妻财", "妻财", "子孙", "兄弟"],
        "fushen": ["", "", "官鬼辛酉金", "", "", ""],
        "hucuozong": ["000001", "011100", "110001"],
    },
    "111110": {
        "ming": ["兑", "☱", "乾", "☰", "泽天夬", "䷪"],
        "xiang": ["—", "—", "—", "—", "—", "--"],
        "guaci": ["泽天夬", "扬于王庭 孚号有厉 告自邑 不利即戎 利有攸往"],
        "yao": ["初九", "九二", "九三", "九四", "九五", "上六"],
        "yaoci": ["壮于前趾 往不胜为咎", "惕号 莫夜有戎 勿恤", "壮于頄 有凶 君子夬夬独行 遇雨若濡有愠 无咎", "臀无肤 其行次且 牵羊悔亡 闻言不信", "苋陆夬夬 中行无咎", "无号 终有凶"],
        "gong": ["坤宫", "土"],
        "shiying": ["", "应", "", "", "世", ""],
        "ganzhi": ["甲子", "甲寅", "甲辰", "丁亥", "丁酉", "丁未"],
        "wuxing": ["水", "木", "土", "水", "金", "土"],
        "liuqin": ["妻财", "官鬼", "兄弟", "妻财", "子孙", "兄弟"],
        "fushen": ["", "父母乙巳火", "", "", "", ""],
        "hucuozong": ["111111", "000001", "011111"],
    },
    "011111": {
        "ming": ["乾", "☰", "巽", "☴", "天风姤", "䷫"],
        "xiang": ["--", "—", "—", "—", "—", "—"],
        "guaci": ["天风姤", "女壮 勿用取女"],
        "yao": ["初六", "九二", "九三", "九四", "九五", "上九"],
        "yaoci": ["系于金柅 贞吉 有攸往 见凶 羸豕孚蹢躅", "包有鱼 无咎 不利宾", "臀无肤 其行次且 厉 无大咎", "包无鱼 起凶", "以杞包瓜 含章 有陨自天", "姤其角 吝 无咎"],
        "gong": ["乾宫", "金"],
        "shiying": ["世", "", "", "应", "", ""],
        "ganzhi": ["辛丑", "辛亥", "辛酉", "壬午", "壬申", "壬戌"],
        "wuxing": ["土", "水", "金", "火", "金", "土"],
        "liuqin": ["父母", "子孙", "兄弟", "官鬼", "兄弟", "父母"],
        "fushen": ["", "妻财甲寅木", "", "", "", ""],
        "hucuozong": ["111111", "100000", "111110"],
    },
    "000110": {
        "ming": ["兑", "☱", "坤", "☷", "泽地萃", "䷬"],
        "xiang": ["--", "--", "--", "—", "—", "--"],
        "guaci": ["泽地萃", "亨 王假有庙 利见大人 亨 利贞 用大牲,吉 利有攸往"],
        "yao": ["初六", "六二", "六三", "九四", "九五", "上六"],
        "yaoci": ["有孚不终 乃乱乃萃 若号,一握为笑 勿恤 往无咎", "引吉无咎 孚乃利用禴", "萃如嗟如 无攸利 往无咎 小吝", "大吉 无咎", "萃有位 无咎匪孚 元永贞 悔亡", "赍咨涕洟 无咎"],
        "gong": ["兑宫", "金"],
        "shiying": ["", "世", "", "", "应", ""],
        "ganzhi": ["乙未", "乙巳", "乙卯", "丁亥", "丁酉", "丁未"],
        "wuxing": ["土", "火", "木", "水", "金", "土"],
        "liuqin": ["父母", "官鬼", "妻财", "子孙", "兄弟", "父母"],
        "fushen": ["", "", "", "", "", ""],
        "hucuozong": ["001011", "111001", "011000"],
    },
    "011000": {
        "ming": ["坤", "☷", "巽", "☴", "地风升", "䷭"],
        "xiang": ["--", "—", "—", "--", "--", "--"],
        "guaci": ["地风升", "元亨 用见大人 勿恤 南征吉"],
        "yao": ["初六", "九二", "九三", "六四", "六五", "上六"],
        "yaoci": ["允升大吉", "孚乃利用禴 无咎", "升虚邑", "王用亨于岐山 吉 无咎", "贞吉升阶", "冥升 利于不息之贞"],
        "gong": ["震宫", "木"],
        "shiying": ["应", "", "", "世", "", ""],
        "ganzhi": ["辛丑", "辛亥", "辛酉", "癸丑", "癸亥", "癸酉"],
        "wuxing": ["土", "水", "金", "土", "水", "金"],
        "liuqin": ["妻财", "父母", "官鬼", "妻财", "父母", "官鬼"],
        "fushen": ["", "兄弟庚寅木", "", "子孙庚午火", "", ""],
        "hucuozong": ["110100", "100111", "000110"],
    },
    "010110": {
        "ming": ["兑", "☱", "坎", "☵", "泽水困", "䷮"],
        "xiang": ["--", "—", "--", "—", "—", "--"],
        "guaci": ["泽水困", "亨 贞大人吉 无咎 有言不信"],
        "yao": ["初六", "九二", "六三", "九四", "九五", "上六"],
        "yaoci": ["臀困于株木 入于幽谷 三岁不觌", "困于酒食 朱绂方来 利用享祀 征凶无咎", "困于石 据于蒺藜 入于其宫 不见其妻 凶", "来徐徐 困于金车 吝 有终", "劓刖 困于赤绂 乃徐有说 利用祭祀", "困于葛藟 于臲卼 曰动悔 有悔 征吉"],
        "gong": ["兑宫", "金", "六合"],
        "shiying": ["世", "", "", "应", "", ""],
        "ganzhi": ["戊寅", "戊辰", "戊午", "丁亥", "丁酉", "丁未"],
        "wuxing": ["木", "土", "火", "水", "金", "土"],
        "liuqin": ["妻财", "父母", "官鬼", "子孙", "兄弟", "父母"],
        "fushen": ["", "", "", "", "", ""],
        "hucuozong": ["101011", "101001", "011010"],
    },
    "011010": {
        "ming": ["坎", "☵", "巽", "☴", "水风井", "䷯"],
        "xiang": ["--", "—", "—", "--", "—", "--"],
        "guaci": ["水风井", "改邑不改井 无丧无得 往来井井 汔至亦未繘井,赢其瓶,凶"],
        "yao": ["初六", "九二", "九三", "六四", "九五", "上六"],
        "yaoci": ["井泥不食 旧井无禽", "井谷射鲋 瓮敝漏", "井渫不食 为我心恻 可用汲 王明 并受其福", "井甃无咎", "井冽 寒泉食", "井收勿幕 有孚元吉"],
        "gong": ["震宫", "木"],
        "shiying": ["", "应", "", "", "世", ""],
        "ganzhi": ["辛丑", "辛亥", "辛酉", "戊申", "戊戌", "戊子"],
        "wuxing": ["土", "水", "金", "金", "土", "水"],
        "liuqin": ["妻财", "父母", "官鬼", "官鬼", "妻财", "父母"],
        "fushen": ["", "兄弟庚寅木", "", "子孙庚午火", "", ""],
        "hucuozong": ["110101", "100101", "010110"],
    },
    "101110": {
        "ming": ["兑", "☱", "离", "☲", "泽火革", "䷰"],
        "xiang": ["—", "--", "—", "—", "—", "--"],
        "guaci": ["泽火革", "巳日乃孚 元亨 利贞 悔亡"],
        "yao": ["初九", "六二", "九三", "九四", "九五", "上六"],
        "yaoci": ["巩用黄牛之革", "巳日乃革之 征吉无咎", "征凶贞厉 革言三就 有孚", "悔亡有孚 改命吉", "大人虎变 未占有孚", "君子豹变 小人革面 征凶 居贞吉"],
        "gong": ["坎宫", "水"],
        "shiying": ["应", "", "", "世", "", ""],
        "ganzhi": ["己卯", "己丑", "己亥", "丁亥", "丁酉", "丁未"],
        "wuxing": ["木", "土", "水", "水", "金", "土"],
        "liuqin": ["子孙", "官鬼", "兄弟", "兄弟", "父母", "官鬼"],
        "fushen": ["", "", "妻财戊午火", "", "", ""],
        "hucuozong": ["011111", "010001", "011101"],
    },
    "011101": {
        "ming": ["离", "☲", "巽", "☴", "火风鼎", "䷱"],
        "xiang": ["--", "—", "—", "—", "--", "—"],
        "guaci": ["火风鼎", "元吉 亨"],
        "yao": ["初六", "九二", "九三", "九四", "六五", "上九"],
        "yaoci": ["鼎颠趾 利出否 得妾以其子 无咎", "鼎有实 我仇有疾 不我能即 吉", "鼎耳革 其行塞 雉膏不食 方雨亏悔 终吉", "鼎折足 覆公𫗧 其形渥 凶", "鼎黄耳金铉 利贞", "鼎玉铉 大吉 无不利"],
        "gong": ["离宫", "火"],
        "shiying": ["", "世", "", "", "应", ""],
        "ganzhi": ["辛丑", "辛亥", "辛酉", "己酉", "己未", "己巳"],
        "wuxing": ["土", "水", "金", "金", "土", "火"],
        "liuqin": ["子孙", "官鬼", "妻财", "妻财", "子孙", "兄弟"],
        "fushen": ["父母己卯木", "", "", "", "", ""],
        "hucuozong": ["111110", "100010", "101110"],
    },
    "100100": {
        "ming": ["震", "☳", "震", "☳", "震为雷", "䷲"],
        "xiang": ["—", "--", "--", "—", "--", "--"],
        "guaci": ["震为雷", "亨 震来虩虩 笑言哑哑 震惊百里 不丧匕鬯"],
        "yao": ["初九", "六二", "六三", "九四", "六五", "上六"],
        "yaoci": ["震来虩虩 后笑言哑哑 吉", "震来厉 亿丧贝 跻于九陵 勿逐 七日得", "震苏苏 震行无眚", "震遂泥", "震往来厉 亿无丧有事", "震索索 视矍矍 征凶 震不于其躬 于其邻 无咎 婚媾有言"],
        "gong": ["震宫", "木", "六冲"],
        "shiying": ["", "", "应", "", "", "世"],
        "ganzhi": ["庚子", "庚寅", "庚辰", "庚午", "庚申", "庚戌"],
        "wuxing": ["水", "木", "土", "火", "金", "土"],
        "liuqin": ["父母", "兄弟", "妻财", "子孙", "官鬼", "妻财"],
        "fushen": ["", "", "", "", "", ""],
        "hucuozong": ["001010", "011011", "001001"],
    },
    "001001": {
        "ming": ["艮", "☶", "艮", "☶", "艮为山", "䷳"],
        "xiang": ["--", "--", "—", "--", "--", "—"],
        "guaci": ["艮为山", "艮其背 不获其身 行其庭 不见其人 无咎"],
        "yao": ["初六", "六二", "九三", "六四", "六五", "上九"],
        "yaoci": ["艮其趾 无咎 利永贞", "艮其腓 不拯其随 其心不快", "艮其限 列其夤 厉熏心", "艮其身 无咎", "艮其辅 言有序 悔亡", "敦艮 吉"],
        "gong": ["艮宫", "土", "六冲"],
        "shiying": ["", "", "应", "", "", "世"],
        "ganzhi": ["丙辰", "丙午", "丙申", "丙戌", "丙子", "丙寅"],
        "wuxing": ["土", "火", "金", "土", "水", "木"],
        "liuqin": ["兄弟", "父母", "子孙", "兄弟", "妻财", "官鬼"],
        "fushen": ["", "", "", "", "", ""],
        "hucuozong": ["010100", "110110", "100100"],
    },
    "001011": {
        "ming": ["巽", "☴", "艮", "☶", "风山渐", "䷴"],
        "xiang": ["--", "--", "—", "--", "—", "—"],
        "guaci": ["风山渐", "女归吉 利贞"],
        "yao": ["初六", "六二", "九三", "六四", "九五", "上九"],
        "yaoci": ["鸿渐于干 小子厉,有言 无咎", "鸿渐于磐 饮食衎衎 吉", "鸿渐于陆 夫征不复 妇孕不育 凶 利御寇", "鸿渐于木 或得其桷 无咎", "鸿渐于陵 妇三岁不孕 终莫之胜 吉", "鸿渐于陆 其羽可用为仪 吉"],
        "gong": ["艮宫", "土"],
        "shiying": ["", "", "世", "", "", "应"],
        "ganzhi": ["丙辰", "丙午", "丙申", "辛未", "辛巳", "辛卯"],
        "wuxing": ["土", "火", "金", "土", "火", "木"],
        "liuqin": ["兄弟", "父母", "子孙", "兄弟", "父母", "官鬼"],
        "fushen": ["", "", "", "", "妻财丙子水", ""],
        "hucuozong": ["010101", "110100", "110100"],
    },
    "110100": {
        "ming": ["震", "☳", "兑", "☱", "雷泽归妹", "䷵"],
        "xiang": ["—", "—", "--", "—", "--", "--"],
        "guaci": ["雷泽归妹", "征凶 无攸利"],
        "yao": ["初九", "九二", "六三", "九四", "六五", "上六"],
        "yaoci": ["归妹以娣 跛能履 征吉", "眇能视 利幽人之贞", "归妹以须 反归以娣", "归妹愆期 迟归有时", "帝乙归妹 其君之袂 不如其娣之袂良 月几望 吉", "女承筐无实 士刲羊无血 无攸利"],
        "gong": ["兑宫", "金"],
        "shiying": ["", "", "世", "", "", "应"],
        "ganzhi": ["丁巳", "丁卯", "丁丑", "庚午", "庚申", "庚戌"],
        "wuxing": ["火", "木", "土", "火", "金", "土"],
        "liuqin": ["官鬼", "妻财", "父母", "官鬼", "兄弟", "父母"],
        "fushen": ["", "", "", "子孙丁亥水", "", ""],
        "hucuozong": ["101010", "001011", "001011"],
    },
    "101100": {
        "ming": ["震", "☳", "离", "☲", "雷火丰", "䷶"],
        "xiang": ["—", "--", "—", "—", "--", "--"],
        "guaci": ["雷火丰", "亨 王假之 勿忧 宜日中"],
        "yao": ["初九", "六二", "九三", "九四", "六五", "上六"],
        "yaoci": ["遇其配主 虽旬无咎 往有尚", "丰其蔀 日中见斗 往得疑疾 有孚发若 吉", "丰其沛 日中见沬 折其右肱 无咎", "丰其蔀 日中见斗 遇其夷主 吉", "来章 有庆誉吉", "丰其屋 蔀其家 窥其户 阒其无人 三岁不觌 凶"],
        "gong": ["坎宫", "水"],
        "shiying": ["", "应", "", "", "世", ""],
        "ganzhi": ["己卯", "己丑", "己亥", "庚午", "庚申", "庚戌"],
        "wuxing": ["木", "土", "水", "火", "金", "土"],
        "liuqin": ["子孙", "官鬼", "兄弟", "妻财", "父母", "官鬼"],
        "fushen": ["", "", "", "", "", ""],
        "hucuozong": ["011110", "010011", "001101"],
    },
    "001101": {
        "ming": ["离", "☲", "艮", "☶", "火山旅", "䷷"],
        "xiang": ["--", "--", "—", "—", "--", "—"],
        "guaci": ["火山旅", "小亨 旅贞吉"],
        "yao": ["初六", "六二", "九三", "九四", "六五", "上九"],
        "yaoci": ["旅琐琐 斯其所取灾", "旅即次 怀其资 得童仆贞", "旅焚其次 丧其童仆 贞厉", "旅于处 得其资斧 我心不快", "射雉 一矢亡 终以誉命", "鸟焚其巢 旅人先笑后号咷 丧牛于易 凶"],
        "gong": ["离宫", "火", "六合"],
        "shiying": ["世", "", "", "应", "", ""],
        "ganzhi": ["丙辰", "丙午", "丙申", "己酉", "己未", "己巳"],
        "wuxing": ["土", "火", "金", "金", "土", "火"],
        "liuqin": ["子孙", "兄弟", "妻财", "妻财", "子孙", "兄弟"],
        "fushen": ["父母己卯木", "", "官鬼己亥水", "", "", ""],
        "hucuozong": ["011110", "110010", "101100"],
    },
    "011011": {
        "ming": ["巽", "☴", "巽", "☴", "巽为风", "䷸"],
        "xiang": ["--", "—", "—", "--", "—", "—"],
        "guaci": ["巽为风", "小亨 利有攸往 利见大人"],
        "yao": ["初六", "九二", "九三", "六四", "九五", "上九"],
        "yaoci": ["进退 利武人之贞", "巽在床下 用史巫 纷若吉 无咎", "频巽吝", "悔亡,田获三品", "贞吉悔亡 无不利 无初有终 先庚三日 后庚三日 吉", "巽在床下 丧其资斧 贞凶"],
        "gong": ["巽宫", "木", "六冲"],
        "shiying": ["", "", "应", "", "", "世"],
        "ganzhi": ["辛丑", "辛亥", "辛酉", "辛未", "辛巳", "辛卯"],
        "wuxing": ["土", "水", "金", "土", "火", "木"],
        "liuqin": ["妻财", "父母", "官鬼", "妻财", "子孙", "兄弟"],
        "fushen": ["", "", "", "", "", ""],
        "hucuozong": ["110101", "100100", "110110"],
    },
    "110110": {
        "ming": ["兑", "☱", "兑", "☱", "兑为泽", "䷹"],
        "xiang": ["—", "—", "--", "—", "—", "--"],
        "guaci": ["兑为泽", "亨 利贞"],
        "yao": ["初九", "九二", "六三", "九四", "九五", "上六"],
        "yaoci": ["和兑吉", "孚兑吉 悔亡", "来兑凶", "商兑未宁 介疾有喜", "孚于剥 有厉", "引兑"],
        "gong": ["兑宫", "金", "六冲"],
        "shiying": ["", "", "应", "", "", "世"],
        "ganzhi": ["丁巳", "丁卯", "丁丑", "丁亥", "丁酉", "丁未"],
        "wuxing": ["火", "木", "土", "水", "金", "土"],
        "liuqin": ["官鬼", "妻财", "父母", "子孙", "兄弟", "父母"],
        "fushen": ["", "", "", "", "", ""],
        "hucuozong": ["101011", "001001", "011011"],
    },
    "010011": {
        "ming": ["巽", "☴", "坎", "☵", "风水涣", "䷺"],
        "xiang": ["--", "—", "--", "--", "—", "—"],
        "guaci": ["风水涣", "亨 王假有庙 利涉大川 利贞"],
        "yao": ["初六", "九二", "六三", "六四", "九五", "上九"],
        "yaoci": ["用拯马壮吉", "涣奔其机 悔亡", "涣其躬 无悔", "涣其群元吉 涣有丘 匪夷所思", "涣汗其大号 涣 王居无咎", "涣其血 去逖出 无咎"],
        "gong": ["离宫", "火"],
        "shiying": ["", "应", "", "", "世", ""],
        "ganzhi": ["戊寅", "戊辰", "戊午", "辛未", "辛巳", "辛卯"],
        "wuxing": ["木", "土", "火", "土", "火", "木"],
        "liuqin": ["父母", "子孙", "兄弟", "子孙", "兄弟", "父母"],
        "fushen": ["", "", "官鬼己亥水", "妻财己酉金", "", ""],
        "hucuozong": ["100001", "101100", "110010"],
    },
    "110010": {
        "ming": ["坎", "☵", "兑", "☱", "水泽节", "䷻"],
        "xiang": ["—", "—", "--", "--", "—", "--"],
        "guaci": ["水泽节", "亨 苦节不可贞"],
        "yao": ["初九", "九二", "六三", "六四", "九五", "上六"],
        "yaoci": ["不出户庭 无咎", "不出门庭 凶", "不节若 则嗟若 无咎", "安节亨", "甘节吉 往有尚", "苦节贞凶 悔亡"],
        "gong": ["坎宫", "水", "六合"],
        "shiying": ["世", "", "", "应", "", ""],
        "ganzhi": ["丁巳", "丁卯", "丁丑", "戊申", "戊戌", "戊子"],
        "wuxing": ["火", "木", "土", "金", "土", "水"],
        "liuqin": ["妻财", "子孙", "官鬼", "父母", "官鬼", "兄弟"],
        "fushen": ["", "", "", "", "", ""],
        "hucuozong": ["100001", "001101", "010011"],
    },
    "110011": {
        "ming": ["巽", "☴", "兑", "☱", "风泽中孚", "䷼"],
        "xiang": ["—", "—", "--", "--", "—", "—"],
        "guaci": ["风泽中孚", "豚鱼 吉 利涉大川 利贞"],
        "yao": ["初九", "九二", "六三", "六四", "九五", "上九"],
        "yaoci": ["虞吉 有它不燕", "鹤鸣在阴 其子和之 我有好爵 吾与尔靡之", "得敌 或鼓或罢 或泣或歌", "月几望 马匹亡 无咎", "有孚挛如 无咎", "翰音登于天 贞凶"],
        "gong": ["艮宫", "土"],
        "shiying": ["应", "", "", "世", "", ""],
        "ganzhi": ["丁巳", "丁卯", "丁丑", "辛未", "辛巳", "辛卯"],
        "wuxing": ["火", "木", "土", "土", "火", "木"],
        "liuqin": ["父母", "官鬼", "兄弟", "兄弟", "父母", "官鬼"],
        "fushen": ["", "", "子孙丙申金", "", "妻财丙子水", ""],
        "hucuozong": ["100001", "001100", "001100"],
    },
    "001100": {
        "ming": ["震", "☳", "艮", "☶", "雷山小过", "䷽"],
        "xiang": ["--", "--", "—", "—", "--", "--"],
        "guaci": ["雷山小过", "亨 利贞 可小事 不可大事 飞鸟遗之音 不宜上宜下 大吉"],
        "yao": ["初六", "六二", "九三", "九四", "六五", "上六"],
        "yaoci": ["飞鸟以凶", "过其祖 遇其妣 不及其君,遇其臣 无咎", "弗过防之 从或戕之,凶", "无咎 弗过遇之 往厉必戒 勿用永贞", "密云不雨 自我西郊 公弋取彼在穴", "弗遇过之 飞鸟离之 凶 是谓灾眚"],
        "gong": ["兑宫", "金"],
        "shiying": ["应", "", "", "世", "", ""],
        "ganzhi": ["丙辰", "丙午", "丙申", "庚午", "庚申", "庚戌"],
        "wuxing": ["土", "火", "金", "火", "金", "土"],
        "liuqin": ["父母", "官鬼", "兄弟", "官鬼", "兄弟", "父母"],
        "fushen": ["", "妻财丁卯木", "", "子孙丁亥水", "", ""],
        "hucuozong": ["011110", "110011", "110011"],
    },
    "101010": {
        "ming": ["坎", "☵", "离", "☲", "水火既济", "䷾"],
        "xiang": ["—", "--", "—", "--", "—", "--"],
        "guaci": ["水火既济", "亨小 利贞 初吉 终乱"],
        "yao": ["初九", "六二", "九三", "六四", "九五", "上六"],
        "yaoci": ["曳其轮 濡其尾 无咎", "妇丧其茀 勿逐 七日得", "高宗伐鬼方 三年克之 小人勿用", "繻有衣袽 终日戒", "东邻杀牛 不如西郊之禴祭 实受其福", "濡其首 厉"],
        "gong": ["坎宫", "水"],
        "shiying": ["", "", "世", "", "", "应"],
        "ganzhi": ["己卯", "己丑", "己亥", "戊申", "戊戌", "戊子"],
        "wuxing": ["木", "土", "水", "金", "土", "水"],
        "liuqin": ["子孙", "官鬼", "兄弟", "父母", "官鬼", "兄弟"],
        "fushen": ["", "", "妻财戊午火", "", "", ""],
        "hucuozong": ["010101", "010101", "010101"],
    },
    "010101": {
        "ming": ["离", "☲", "坎", "☵", "火水未济", "䷿"],
        "xiang": ["--", "—", "--", "—", "--", "—"],
        "guaci": ["火水未济", "亨 小狐汔济 濡其尾 无攸利"],
        "yao": ["初六", "九二", "六三", "九四", "六五", "上九"],
        "yaoci": ["濡其尾 吝", "曳其轮 贞吉", "未济征凶 利涉大川", "贞吉悔亡 震用伐鬼方 三年有赏于大国", "贞吉无悔 君子之光 有孚吉", "有孚于饮酒 无咎 濡其首 有孚失是"],
        "gong": ["离宫", "火"],
        "shiying": ["", "", "世", "", "", "应"],
        "ganzhi": ["戊寅", "戊辰", "戊午", "己酉", "己未", "己巳"],
        "wuxing": ["木", "土", "火", "金", "土", "火"],
        "liuqin": ["父母", "子孙", "兄弟", "妻财", "子孙", "兄弟"],
        "fushen": ["", "", "官鬼己亥水", "", "", ""],
        "hucuozong": ["101010", "101010", "101010"],
    }
};
// 少阴-8  少阳-7  老阴-6  老阳-9
const YINYANG = {
    "8": ["0", "0", "#551A8B"],
    "7": ["1", "1", "#551A8B"],
    "6": ["0", "1", "#FFD700"],
    "9": ["1", "0", "#FFD700"]
};
// 六神兽：日天干
const LIUSHEN = {
    "甲": ["青龙", "朱雀", "勾陈", "螣蛇", "白虎", "玄武"],
    "乙": ["青龙", "朱雀", "勾陈", "螣蛇", "白虎", "玄武"],
    "丙": ["朱雀", "勾陈", "螣蛇", "白虎", "玄武", "青龙"],
    "丁": ["朱雀", "勾陈", "螣蛇", "白虎", "玄武", "青龙"],
    "戊": ["勾陈", "螣蛇", "白虎", "玄武", "青龙", "朱雀"],
    "己": ["螣蛇", "白虎", "玄武", "青龙", "朱雀", "勾陈"],
    "庚": ["白虎", "玄武", "青龙", "朱雀", "勾陈", "螣蛇"],
    "辛": ["白虎", "玄武", "青龙", "朱雀", "勾陈", "螣蛇"],
    "壬": ["玄武", "青龙", "朱雀", "勾陈", "螣蛇", "白虎"],
    "癸": ["玄武", "青龙", "朱雀", "勾陈", "螣蛇", "白虎"]
};
// 金生水，水生木，木生火，火生土，土生金。
// 金克木，木克土，土克水，水克火，火克金。
const WUXINGLIUQIN = {
    "金": {"金": "兄弟", "水": "子孙", "木": "妻财", "火": "官鬼", "土": "父母"},
    "水": {"水": "兄弟", "木": "子孙", "火": "妻财", "土": "官鬼", "金": "父母"},
    "木": {"木": "兄弟", "火": "子孙", "土": "妻财", "金": "官鬼", "水": "父母"},
    "火": {"火": "兄弟", "土": "子孙", "金": "妻财", "水": "官鬼", "木": "父母"},
    "土": {"土": "兄弟", "金": "子孙", "水": "妻财", "木": "官鬼", "火": "父母"}
}
// 旺相
const WANGXIANG = {
    "子":["子", "亥", "寅", "卯"],
    "丑":["丑", "辰", "未", "戌", "申", "酉"],
    "寅":["寅", "卯", "巳", "午"],
    "卯":["卯", "寅", "巳", "午"],
    "辰":["辰", "丑", "未", "戌", "申", "酉"],
    "巳":["巳", "午", "丑", "辰", "未", "戌"],
    "午":["午", "巳", "丑", "辰", "未", "戌"],
    "未":["未", "丑", "辰", "戌", "申", "酉"],
    "申":["申", "酉", "子", "亥"],
    "酉":["酉", "申", "子", "亥"],
    "戌":["戌", "丑", "辰", "未", "申", "酉"],
    "亥":["亥", "子", "寅", "卯"]
}
// 月破
const MONTHPO = {"正": "申", "二": "酉", "三": "戌", "四": "亥", "五": "子", "六": "丑", "七": "寅", "八": "卯", "九": "辰", "十": "巳", "冬": "午", "腊": "未"}
// 天元禄：日天干→ 甲在'寅'，乙在'卯'，丙戊在'巳'，丁己在'午'，庚在'申'，辛在'酉'，壬在'亥'，癸在'子'。
const TIANYUANLU = {"甲": "寅", "乙": "卯", "丙": "巳", "丁": "午", "戊": "巳", "己": "午", "庚": "申", "辛": "酉", "壬": "亥", "癸": "子"};
// 驿马：时地支→ (申子辰)马为'寅'、(寅午戌)马为'申'、(巳酉丑)马为'亥'、(亥卯未)马为'巳'。1天1个。
const YIMA = {"子": "寅", "丑": "亥", "寅": "申", "卯": "巳", "巳": "亥", "辰": "寅", "午": "申", "未": "巳", "申": "寅", "酉": "亥", "戌": "申", "亥": "巳"};
// 天乙贵人：日天干→ 甲戊在'丑未'，乙己在'申子'，丙丁在'酉亥'，壬癸在'卯巳'，庚辛在'寅午'。（此查法为天乙正宗）
const TIANYIGUIREN = {"甲": "丑未", "乙": "申子", "丙": "酉亥", "丁": "酉亥", "戊": "丑未", "己": "申子", "庚": "庚午", "辛": "庚午", "壬": "卯巳", "癸": "卯巳"};
// 太极贵人：年天干或日天干
const TAIJIGUIREN = {
    "甲": ["子", "午"],
    "乙": ["子", "午"],
    "丙": ["卯", "酉"],
    "丁": ["卯", "酉"],
    "戊": ["辰", "戌", "丑", "未"],
    "己": ["辰", "戌", "丑", "未"],
    "庚": ["寅", "亥"],
    "辛": ["寅", "亥"],
    "壬": ["巳", "申"],
    "癸": ["巳", "申"]
};
// 天德贵人：月地支→ 子在'巽巳'，丑在'庚申'，寅在'丁未'，卯在'坤申'，辰在'壬亥'，巳在'辛戌'，午在'乾亥'，未在'甲寅'，申在'癸丑'，酉在'寅'，戌在'丙巳'，亥在'乙辰'。
const TIANDEGUIREN = {"子": "巽巳", "丑": "庚申", "寅": "丁未", "卯": "坤申", "辰": "庚亥", "巳": "辛戌", "午": "乾亥", "未": "甲寅", "申": "癸丑", "酉": "寅", "戌": "丙巳", "亥": "乙辰"};
// 月德贵人：月地支→ 寅午戌在'丙'，申子辰在'壬'，亥卯未在'甲'，巳酉丑在'庚'。
const YUEDEGUIREN = {"子": "庚", "丑": "庚", "寅": "丙", "卯": "甲", "辰": "庚", "巳": "庚", "午": "丙", "未": "甲", "申": "庚", "酉": "庚", "戌": "丙", "亥": "甲"};
// 天喜：月地支→ 寅卯辰春天在'戌'，巳午未夏天在'丑'，申酉戌秋天在'辰'，亥子丑冬天在'未'。
const TIANXI = {"子": "未", "丑": "未", "寅": "戌", "卯": "戌", "辰": "戌", "巳": "丑", "午": "丑", "未": "丑", "申": "辰", "酉": "辰", "戌": "辰", "亥": "未"};
// 天马：月地支→ 寅申在'午'，卯酉在'申'，辰戌在'戌'，巳亥在'子'，子午在'寅'，丑未在'辰'。
const TIANMA = {"子": "寅", "丑": "辰", "寅": "午", "卯": "申", "辰": "戌", "巳": "子", "午": "寅", "未": "辰", "申": "午", "酉": "申", "戌": "戌", "亥": "子"};
// 唐符国印：年地支→ 寅申在'巳亥'，巳亥在'寅申'；子午在'卯酉'，卯酉在'子午'；辰戌在'丑未'，丑未在'辰戌'。
const TANGFUGUOYIN = {"子": "卯酉", "丑": "辰戌", "寅": "巳亥", "卯": "子午", "辰": "丑未", "巳": "寅申", "午": "卯酉", "未": "辰戌", "申": "巳亥", "酉": "子午", "戌": "丑未", "亥": "寅申"};
// 天医：月地支→ 子在'亥'，丑在'子'，寅在'丑'，卯在'寅'，辰在'卯'，巳在'辰'，午在'巳'，未在'午'，申在'未'，酉在'申'，戌在'酉'，亥在'戌'。
const TIANYI = {"子": "亥", "丑": "子", "寅": "丑", "卯": "寅", "辰": "卯", "巳": "辰", "午": "巳", "未": "午", "申": "未", "酉": "申", "戌": "酉", "亥": "戌"};
// 皇恩：月地支→ 寅申在'未'，卯酉在'酉'，辰戌在'亥'，巳亥在'丑'，子午在'卯'，丑未在'巳'。
const HUANGEN = {"子": "卯", "丑": "巳", "寅": "未", "卯": "酉", "辰": "亥", "巳": "丑", "午": "卯", "未": "巳", "申": "未", "酉": "酉", "戌": "亥", "亥": "丑"};
// 文昌：日天干→ 甲在'巳'，乙在'午'，丙在'申'，丁在'酉'，戊在'申'，己在'酉‘，庚在'亥'，辛在'子'，壬在'寅'，癸在'卯'。
const WENCHANG = {"甲": "巳", "乙": "午", "丙": "申", "丁": "酉", "戊": "申", "己": "酉", "庚": "亥", "辛": "子", "壬": "寅", "癸": "卯"};
// 咸池（桃花）：日地支→ 申子辰在'酉'，寅午戌在'卯'，巳酉丑在'午'，亥卯未在'子'。
const XIANCHI = {"子": "酉", "丑": "午", "寅": "卯", "卯": "子", "辰": "酉", "巳": "午", "午": "卯", "未": "子", "申": "酉", "酉": "午", "戌": "卯", "亥": "子"};
// 将星：年地支或日地支→ 申子辰在'子'，巳酉丑在'酉'，寅午戌在'午'，亥卯未在'卯'。
const JIANGXING = {"子": "子", "丑": "酉", "寅": "午", "卯": "卯", "辰": "子", "巳": "酉", "午": "午", "未": "卯", "申": "子", "酉": "酉", "戌": "午", "亥": "卯"};
// 华盖：年地支或日地支→ 申子辰在'辰'，巳酉丑在'丑'，寅午戌在'戌'，亥卯未在'未'。
const HUAGAI = {"子": "辰", "丑": "丑", "寅": "戌", "卯": "未", "辰": "辰", "巳": "丑", "午": "戌", "未": "未", "申": "辰", "酉": "丑", "戌": "戌", "亥": "未"};
// 谋星：日地支→ 申子辰在'戌'，巳酉丑在'未'，寅午戌在'辰'，亥卯未在'丑'。
const MOUXING = {"子": "戌", "丑": "未", "寅": "辰", "卯": "丑", "辰": "戌", "巳": "未", "午": "辰", "未": "丑", "申": "戌", "酉": "未", "戌": "辰", "亥": "丑"};
// 羊刃；日天干→ 甲在'卯'，乙在'寅'，丙在'午'，丁在'巳'，戊在'午'，己在'巳'，庚在'酉'，辛在'申'，壬在'子'，癸在'亥'。
const YANGREN = {"甲": "卯", "乙": "寅", "丙": "午", "丁": "巳", "戊": "午", "己": "巳", "庚": "酉", "辛": "申", "壬": "子", "癸": "亥"};
// 劫煞：日地支→ 申子辰在'巳'，巳酉丑在'寅'，寅午戌在'亥'，亥卯未在'申'。
const JIESHA = {"子": "巳", "丑": "寅", "寅": "亥", "卯": "申", "辰": "巳", "巳": "寅", "午": "亥", "未": "申", "申": "巳", "酉": "寅", "戌": "亥", "亥": "申"};
// 灾煞：日地支→ 申子辰在'午'，巳酉丑在'卯'，寅午戌在'子'，亥卯未在'酉'。
const ZAISHA = {"子": "午", "丑": "卯", "寅": "子", "卯": "酉", "辰": "午", "巳": "卯", "午": "子", "未": "酉", "申": "午", "酉": "卯", "戌": "子", "亥": "酉"};
// 公历大小月
const MONTHHEAD = [31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31];

function drawCanvas(prefix, name, number, color){
    let id = prefix + name + "Canvas";
    let c = document.getElementById(id);
    let ctx = c.getContext("2d");
    let w = c.width;
    let h = c.height;
    ctx.clearRect(0, 0, w, h);  // 重置画布
    c.style.backgroundColor = color;
    if (number == "0"){
        ctx.fillStyle = "#fff";
        ctx.fillRect(80,0,40,30);
    }
}

function textData(number, date, lunarDate){
    let dateStr = date[0]+"年"+date[1]+"月"+date[2]+"日"+date[3]+"时";
    let lunarMonth = lunarDate.getMonthInChinese();
    let lunarStr = lunarMonth+"月"+lunarDate.getDayInChinese();
    let dayGan = lunarDate.getDayGan();     // 日天干
    let yearZhi = lunarDate.getYearZhi();   // 年地支
    let monthZhi = lunarDate.getMonthZhi(); // 月地支
    let dayZhi = lunarDate.getDayZhi();     // 日地支
    let timeZhi = lunarDate.getTimeZhi();   // 时地支
    $('#dateLunar').text(dateStr+" "+lunarStr);
    $('#bazi').text(lunarDate.getBaZi().join(" "));
    $('#wangxiang').html(
        "<span>月破="+MONTHPO[lunarMonth]+"</span>"
        +"<span class='ms-3'>日空="+lunarDate.getDayXunKong()+"</span><br/>"
        +"<span>旺相 (月="+WANGXIANG[monthZhi]+"</span>"
        +"<span class='ms-3'>日="+WANGXIANG[dayZhi]+")</span>"
    );
    $('#shensha').html(
        "<span>贵人 (太极="+TAIJIGUIREN[dayGan]+"</span>"
        +"<span class='mx-3'>天乙="+TIANYIGUIREN[dayGan]+"</span>"
        +"<span>天德="+TIANDEGUIREN[monthZhi]+"</span>"
        +"<span class='ms-3'>月德="+YUEDEGUIREN[monthZhi]+")</span><br/>"
        +"<span>天元禄="+TIANYUANLU[dayGan]+"</span>"
        +"<span class='mx-3'>驿马="+YIMA[timeZhi]+"</span>"
        +"<span>天喜="+TIANXI[monthZhi]+"</span>"
        +"<span class='mx-3'>天马="+TIANMA[monthZhi]+"</span>"
        +"<span>唐符国印="+TANGFUGUOYIN[yearZhi]+"</span>"
        +"<span class='mx-3'>天医="+TIANYI[monthZhi]+"</span>"
        +"<span>皇恩="+HUANGEN[monthZhi]+"</span><br/>"
        +"<span>文昌="+WENCHANG[dayGan]+"</span>"
        +"<span class='mx-3'>桃花="+XIANCHI[dayZhi]+"</span>"
        +"<span>将星="+JIANGXING[dayZhi]+"</span>"
        +"<span class='mx-3'>华盖="+HUAGAI[dayZhi]+"</span>"
        +"<span>谋星="+MOUXING[dayZhi]+"</span>"
        +"<span class='mx-3'>羊刃="+YANGREN[dayGan]+"</span>"
        +"<span>劫煞="+JIESHA[dayZhi]+"</span>"
        +"<span class='ms-3'>灾煞="+ZAISHA[dayZhi]+"</span>"
    );
    let data =  GUA[number];
    $('#benming').text("本卦: 上"+data.ming[0]+"下"+data.ming[2]+" "+data.ming[4]+" ("+data.gong+")");
    $('#benguaci').text(data.guaci[1]);
    for(let i=0; i<6; i++){
        $('#benls'+i).text(LIUSHEN[dayGan][i]);
        $('#benfs'+i).text(data.fushen[i]);
        $('#benlgw'+i).text(data.liuqin[i]+data.ganzhi[i]+data.wuxing[i]);
        $('#bensy'+i).text(data.shiying[i]);
        $('#benyc'+i).text(data.yao[i] + " " + data.yaoci[i]);
    }
}

function bianTextData(benNumber, bianNumber, lunarDate){
    let benData =  GUA[benNumber];
    let bianData =  GUA[bianNumber];
    let wx = bianData.wuxing;
    let wxlq = WUXINGLIUQIN[benData.gong[1]];
    let liuqin = [wxlq[wx[0]], wxlq[wx[1]], wxlq[wx[2]], wxlq[wx[3]], wxlq[wx[4]], wxlq[wx[5]]];
    let dayGan = lunarDate.getDayGan();  // 日天干
    $('#bianming').text("变卦: 上"+bianData.ming[0]+"下"+bianData.ming[2]+" "+bianData.ming[4]+" ("+bianData.gong+")");
    $('#bianguaci').text(bianData.guaci[1]);
    for(let i=0; i<6; i++){
        $('#bianls'+i).text(LIUSHEN[dayGan][i]);
        $('#bianlgw'+i).text(liuqin[i]+bianData.ganzhi[i]+bianData.wuxing[i]);
        $('#biansy'+i).text(bianData.shiying[i]);
        $('#bianyc'+i).text(bianData.yao[i] + " " + bianData.yaoci[i]);
    }
}

function selectDate(){
    let lyYearId = $('#lyYear');
    let lyMonthId = $('#lyMonth');
    let lyDayId = $('#lyDay');
    let lyHourId = $('#lyHour');
    optionsClear(lyYearId);
    optionsClear(lyMonthId);
    optionsClear(lyDayId);
    optionsClear(lyHourId);
    let nowDate = new Date();
    let year = nowDate.getFullYear();
    let month = nowDate.getMonth() + 1;
    let monthSys = nowDate.getMonth();
    let day = nowDate.getDate();
    let hour = nowDate.getHours();
    for(let i=(year-4); i<(year+5); i++){lyYearId.append("<option value='"+i+"'>"+i+" 年</option>");}
    for(let i=1; i<13; i++){lyMonthId.append("<option value='"+i+"'>"+i+" 月</option>");}
    for(let i=0; i<24; i++){lyHourId.append("<option value='"+i+"'>"+i+" 时</option>");}
    $("#lyYear option[value='"+year+"']").prop("selected", true);
    $("#lyMonth option[value='"+month+"']").prop("selected", true);
    $("#lyHour option[value='"+hour+"']").prop("selected", true);
    let num = MONTHHEAD[monthSys];
    if(monthSys == 1 && checkYear(lyYearId.val())){num++}
    writeDay(num);
    $("#lyDay option[value='"+day+"']").prop("selected", true);
    lyYearId.on('change', function(){
        let value = $(this).val();
        let monthVal = lyMonthId.val();
        if(monthVal == ""){optionsClear(lyDayId);}
        let num = MONTHHEAD[monthVal - 1];
        if(monthVal == 2 && checkYear(value)){num++;}
        writeDay(num)
    });
    lyMonthId.on('change', function(){
        let value = $(this).val();
        let yearVal = lyYearId.val();
        if(yearVal == ""){optionsClear(lyDayId);}
        let num = MONTHHEAD[value - 1];
        if(value == 2 && checkYear(yearVal)){num++;}
        writeDay(num)
    });
}
function writeDay(num){
    let sd = $('#lyDay');
    optionsClear(sd);
    for (let i=1; i<(num+1); i++){sd.append("<option value='"+i+"'>"+i+" 日</option>");}
}
// 判断平年闰年
function checkYear(year){return(0 == year%4 && (year%100 !=0 || year%400 == 0));}
// 重置日期选项
function optionsClear(e){e[0].options.length = 0;}

$(function(){
    $('#startBtn, #cancelBtn').click(function(){
        $('#chu option')[0].selected = true;
        $('#er option')[0].selected = true;
        $('#san option')[0].selected = true;
        $('#si option')[0].selected = true;
        $('#wu option')[0].selected = true;
        $('#liu option')[0].selected = true;
        $('#submitBtn').hide();
        selectDate();
    });
    $('#liu').on('change', function(){
        let chu = $('#chu option:selected').val();
        let er = $('#er option:selected').val();
        let san = $('#san option:selected').val();
        let si = $('#si option:selected').val();
        let wu = $('#wu option:selected').val();
        let liu = $('#liu option:selected').val();
        let verify = chu + er + san + si + wu + liu;
        verify.length == 6 ? $('#submitBtn').show(300) : $('#submitBtn').hide();
    });
    $('#submitBtn').click(function(){
        let year = parseInt($('#lyYear').val());
        let month = parseInt($('#lyMonth').val());
        let day = parseInt($('#lyDay').val());
        let hour = parseInt($('#lyHour').val());
        let date = [year, month, day, hour];
        let lunarDate = Solar.fromYmdHms(year, month, day, hour, 0, 0).getLunar();  // 获取农历
        let chu = YINYANG[$('#chu option:selected').val()];
        let er = YINYANG[$('#er option:selected').val()];
        let san = YINYANG[$('#san option:selected').val()];
        let si = YINYANG[$('#si option:selected').val()];
        let wu = YINYANG[$('#wu option:selected').val()];
        let liu = YINYANG[$('#liu option:selected').val()];
        let ben = chu[0] + er[0] + san[0] + si[0] + wu[0] + liu[0] + "";
        let bian = chu[1] + er[1] + san[1] + si[1] + wu[1] + liu[1] + "";
        let benArray = [["chu", chu[0], chu[2]], ["er", er[0], er[2]], ["san", san[0], san[2]], ["si", si[0], si[2]], ["wu", wu[0], wu[2]], ["liu", liu[0], liu[2]]];
        benArray.forEach(e => {drawCanvas("ben", e[0], e[1], e[2]);});
        textData(ben, date, lunarDate);
        if(ben != bian){
            let bianArray = [["chu", chu[1], chu[2]], ["er", er[1], er[2]], ["san", san[1], san[2]], ["si", si[1], si[2]], ["wu", wu[1], wu[2]], ["liu", liu[1], liu[2]]];
            bianArray.forEach(e => {drawCanvas("bian", e[0], e[1], e[2]);});
            bianTextData(ben, bian, lunarDate);
            $('#bianDiv').show();
        }else{$('#bianDiv').hide();}
    });
});
